app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `name`, `updated_at`) VALUES ('2013-11-09 07:53:45', 'Karuppannan.irtt@gmail.com', 'karuppannan', '2013-11-09 07:53:45')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `email` = 'karuppannan.irtt@gmail.comarups', `updated_at` = '2013-11-12 16:29:19' WHERE `users`.`id` = 39
---
  def update
    respond_to do |format|
      if @user.update(user_params)